# 1) записати з инпута 10 чисел
# Task 1.0
# list_num = []
# for i in range(1, 5):
#     num = int(input(f'Enter number {i}: '))
#     list_num.append(num)
# print(list_num)
# --------------------------Task 1.1-------------------------
#   - знайти найменше не змінюючи існуючу коленцію Task 1.1
# list_num.sort()
# print(list_num[0])
# ------------------------------------------------
# min_num = list_num[0]
# for i in range(len(list_num)):
#     if list_num[i] <= list_num[0]:
#         list_num[0] = list_num[i]
#         min_num = list_num[i]
# print(min_num)
# --------------------------------------------------
# min_num = min(list_num)
# print(min_num)
# ---------------------------------Task 1.2------------------------
#   - знайти всі від'ємні числа не змінюючи існуючу колекцію Task 1.2
# list_num_negative = [i for i in list_num if i < 0]
# print(list_num_negative)
# ------------------------------------Task 1.3---------------------
#   - видалити всі одинакові значення Task 1.3
# new_set = set(list_num)
# print(new_set)
# -------------------------------Task 1.5---------------------------------
#   - замінити кожне 4 значення на "Х" Task 1.4
# for i in range(3, len(list_num), 4):
#     list_num[i] = 'X'
# print(list_num)
# ------------------------------------Task 1.6-----------------------------------------
#   - вивести найближче значення до середньоарифметичного з цілої колекції Task 1.6

# 2) "  я вчусь  На пайтоніста _ але в мені нічого НЕ   виходить ,   бо я    вчу  jS...    "
# скопіювати це речення і вивести його без помилок
# -------------------------------------------------------------------------------------------
# text = "  я вчусь  На пайтоніста _ але в мені нічого НЕ   виходить ,   бо я    вчу  jS...    "
# new_text = text.strip().lower().capitalize().replace('..', '').replace('_', ',').replace(' ,', ',').replace('  ',
#                                                                                                             ' ').replace(
#     '  ', ' ')
# print(new_text)
# -------------------------------------------------
# задачка (для тех кому скучно):
#
# генерируем лист с непарных чисел в порядке возрастания [1,3,5,7,9.....n]
# задача сделать c него лист листов такого плана:
#
# [1, 3, 5, 7, 9, 11, 13, 15, 17, 19]  => [ [1], [3,5], [7,9,11], [13,15,17,19] ]
# [1, 3, 5, 7, 9, 11] => [[1], [3, 5], [7, 9, 11]]
# [1, 3, 5, 7, 9]  => [ [1], [3,5], [7,9]]
# [1, 3, 5, 7, 9, 11, 13]  => [[1], [3, 5], [7, 9, 11], [13]]
# -------------------------------------------------------------
# n = 10
# odd_numbers = [i for i in range(1, n*2, 2)] # генерує масив
# print(odd_numbers)
# new_list = []
# i = 0
# m = 1
# while i < len(odd_numbers):
#     n = i
#     m = (len(new_list) + 1) * (len(new_list) + 2) // 2
#     new_list.append(odd_numbers[n:m])
#     i = len(new_list) * (len(new_list) + 1) // 2
# print(new_list)
# -------------------------------------------------------------

# ---------------HW mentor cod_________________
# 1) записати з инпута 10 чисел
# st = '22,5,4,87,9, 10, -9,55,  88,99'
#
# while st.find(' ') != -1:
#     st = st.replace(' ', '')
# st = st.split(',')
#
# l = [int(i) for i in st if i.lstrip('-').isdigit()]
# if len(l) != 10:
#     print('Error')
# else:
#     print(l)
# - знайти найменше не змінюючи існуючу коленцію
# min_item = l[0]
# for i in l:
#     if i <= min_item:
#         min_item = i
# print(min_item)

# - видалити всі одинакові значення
# # l.sort()
# for i in l:
#     if l.count(i) > 1:
#         l.remove(i)
# print(l)
# - замінити кожне 4 значення на "Х"
# for i in range(3, len(l), 4):
#     l[i] = 'X'
# print(l)
# -------------------------------------------------------------------------------------------
# st = "  я вчусь  На пайтоніста _ але в мені нічого НЕ   виходить ,   бо я    вчу  jS...    "
#
# st = st.lower().split()
# st[0] = st[0].upper()
# st = ' '.join(st)
# st = st.replace(" _", ",").replace("мені", "мене").replace(" ,", ",").replace("js", "JS")
# print(st)
# ---------------------------------------------------------------------------------------------
# # [1,2,3,4,5,6,7,8,9] => 5
# # [-1,-2,3,4,555] => 4
# # [5,5,5,5] => 5
# # [-10,5,5] => 5
# - вивести найближче значення до середньоарифметичного з цілої колекції
# l = [-10,5,111, 2222]
# l.sort()
# sum = 0
# for i in l:
#     sum += i
# avg = sum/len(l)
#
# canditates = []
# for i in range(len(l)):
#     if l[i] > avg:
#         canditates.append(l[i])
#         canditates.append(l[i-1])
#         break
# print('List =', l)
# print('Avg =', avg)
#
# if not len(canditates):
#     print('result: ', avg)
# else:
#     print('result =', canditates[0] if avg > (canditates[0] + canditates[1]) else canditates[1])
# ---------------------------------------------------------------------------------------------------
# #Вариант от Вовы
# l =[-1,-2,3,4,5]
# #центр
# cen = 0
# #дізнаємося середнє значення
# for i in l:
#     cen+=i
# cen /= len(l)
# print(cen)
# #створюємо ліст з різницею між
# #числами основного ліста і центром
# l2 = [i-cen for i in l]
# print(l2)
# # знінюємо відемне значення числа на додатнє
# count = 0
# for i in l2:
#     if i<0:
#         l2[count] = i-i-i
#     else:
#         l2[count]= i
#     count+=1
# # #робимо копію ліста різниць
# l2_copy = l2.copy()
# # #сортуємо копію, щоб знайти найменше,
# # # тобто перше число в лісті
# l2_copy.sort()
# # #записуємо перше число з відсортованого ліста
# e = l2_copy[0]
# # #знаходимо індекс цього числа в невідсортованому лісті різниць
# index = l2.index(e)
# # #індекс з ліста різниць буде такий самий як і індекс в основному лісті
# print(l[index])
# ---------------------------------------------------------------------------------
# 3) написати програму, яка підраховує вартість витрачених коштів за тиждень.
#   1)Ви записуєте: дату, товар і ціну,
#   2)ці записи можна редагувати,
#   3)таких записів у вас може бути безліч
#   4)у вас має бути меню:
#     - список всіх записів
#     - загальна вартість всіх покупок
#     - найдорожча покупка
#     - пошук по назві товару
#     - покупки по днях
notebook = [
    [2, 'car', 100000],
    [3, 'mobile', 555],
    [2, 'coffee', 25]
]
while True:
    print('1. Показати всі покупки')
    print('2. Загальна вартість всіх покупок')
    print('3. Показати найбільш дорогу покупку')
    print('4. Пошук по назві товару')
    print('5. Показати покупки по днях')
    print('6. Вихід')
    choice = input('Зробіть свій вибір: ')
    print('')
    if not choice.isdigit():
        continue
    choice = int(choice)
    if choice == 1:
        print('---------------------------------------------------')
        for item in notebook:
            print(f'{item[0]} день {item[1]} за {item[2]} грн.')
        print('---------------------------------------------------\n')
    if choice == 2:
        sum_of_items = 0
        for item in notebook:
            sum_of_items += item[2]
        print('---------------------------------------------------')
        print('Сума всіх покупок становить: ', sum_of_items)
        print('---------------------------------------------------\n')
    if choice == 3:
        max_price = max(item[2] for item in notebook)
        print('---------------------------------------------------')
        for item in notebook:
            if item[2] == max_price:
                print(f'Найбільш дорога покупка була {item[0]}-го числа за {item[2]} грн. і це {item[1]}')
        print('---------------------------------------------------\n')
    if choice == 4:
        find = input('Введіть назву товару: ').strip().lower()
        print('---------------------------------------------------')
        print([item for item in notebook if item[1] == find])
        print('---------------------------------------------------\n')
    if choice == 5:
        data = input('Введіть дату: ').strip()
        data = int(data) if data.isdigit() else None
        if not data:
            print('Error')
        else:
            for item in notebook:
                if item[0] == data:
                    print('---------------------------------------------------')
                    print(item)
                    print('---------------------------------------------------\n')
    if choice == 6:
        break
