# 1) написати прогу яка перевіряє, чи існує введений текст в строці
# #   якщо існує, то вивести "Так, є!", якщо немає - "Немає..."
# print('yes') if input('Enter text: ') else print('no')
# ---------------------------------------------------------
# 2) написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому,
#   наприклад:
#   st = 'as 23 fdfdg544' #введена строка
#   2,3,5,4,4        #вивело в консолі
# st = 'hhdjd jd5df9g83 25'
# result = ''
# for i in st:
#     if i.isdecimal():
#         result += i
# result = ', '.join(result)
# print(result)
# ------------------------------------------------------
# # 3) написати прогу яка вибирає зі введеної строки цифри і виводить їх так як вони написані,
#   наприклад:
#   st = 'as 23 fdfdg544' #введена строка
#   23, 544            #вивело в консолі
# st = 'hhdjd jd5df9g83 25'
# result = ''
# for i in st:
#     if i.isdigit():
#         result += i
#     else:
#         result += ' '
#         result = result.replace(' ', ' ')
# result = ', '.join(result.split())
# print(result)
# -----------------------------------------------------------
# 4) з введеної пошти зробити логін, наприклад:
# #   mail = 'bigboss@gmail.com' #введена строка
# #   login = 'bigboss'       #вивело в консолі
# mail = 'bigboss@gmail.com'
# i = mail.find('@')
# i = None if i == -1 else i
# result = mail[:i] if i else None
# if result:
#     print('login:', result)
# else:
#     print('error')
# ---------------------------------------------------------
# 5) прога, що перевіряє чи в строці є пошта
# st = 'bigbossgmail.com'
# i = st.find('@')
# i = None if i == -1 else i
# print('Yes. This is mail'if i and st.count('@') == 1 and len(st[:i]) > 0 and st[0].isalpha() and len(st[i + 1:].split('.')) >= 1 else 'No. This isn\'t mail.')
#-------------------------------------------------------------------
# 6) прога, що виводить кількість кожного символа з введеної строки,
#                                                            наприклад:
# st = 'as 23 fdfdg544' #введена строка
#      'a' -> 1  #вивело в консолі
# 's' -> 1
# ' ' -> 2
# '2' -> 1
# '3' -> 1
# 'f' -> 2
# 'd' -> 2
# 'g' -> 1
# '5' -> 1
# '4' -> 2
# ---------------------------
# st = 'as 23 fdfdg544'
# for i in st:
#     count = st.count(i)
#     if i.isalnum(): #без пустих
#         print(f"'{i}' -> {count}")
# --------------------------------
# st = 'gdffffr 88 775 ldkdkkjfjg9999999999999999999999'
# for i in st:
#     count = st.count(i)
#     if count:
#         print(f"'{i}' -> {count}")
#         st = st.replace(i, '')
# ----------------------------------------------------
# 7) написати прогу, яка формує повідомлення юзеру, наприклад:
#   user_name = 'Sem'  #введена строка
#   user_mail = 'sem@gmail.com'    #введена строка
#   user_address = 'blablabla'    #введена строка
#   "Доброго дня, Sem!
#    Ми відправили Вам спам на Ваш email: sem@gmail.com,
#    а також на адресу: blablabla, яку Ви вказали, ми відправили проживати 30 біженців із пакістану.
#    Дякуємо за звернення!"
#    P.S. текст в листі можна змінювати)
# ---------------------------------------------------------
# user_name = 'Sem'  #введена строка
# user_mail = 'sem@gmail.com'    #введена строка
# user_address = 'blablabla'    #введена строка
# print(f'"Доброго дня, {user_name}!')
# print(f'Ми відправили Вам спам на Ваш email: {user_mail},')
# print(f'а також на адресу: {user_address}, яку Ви вказали, ми відправили проживати 30 біженців із пакістану.')
# print('Дякуємо за звернення!"')